In [1]:
import xml.etree.ElementTree as ET
import pandas as pd

In [2]:
tree = ET.parse('data/em_data.xml')
root = tree.getroot()

In [3]:
player = pd.DataFrame([player.attrib for player in root.iter('person')]).set_index('id')
rodada = pd.DataFrame([rodada.attrib for rodada in root.iter('round')]).set_index('number')
matches = pd.DataFrame([match.attrib for match in root.iter('match')])

In [4]:
player.head()

                   first     last middle country
id
6318763055  João Gabriel  Marques             BR
3081108402        Thiago   Dantas      A      BR
7114559834         Lucas    Nunes             US
8431408074         Bruno  Almeida             BR
6114367291      Giovanni   Santin      D      BR

In [5]:
torneio = []
for n, rodada in enumerate(root.iter('round')):
    for match in rodada.iter('match'):
        temp = match.attrib
        temp['rodada'] = n+1
        torneio.append(temp)
torneio = pd.DataFrame(torneio)

In [6]:
torneio.head()

       person    opponent outcome win loss draw  rodada
0  6318763055  3081108402       1   2    1    0       1
1  7114559834  8431408074       2   1    1    0       1
2  4319611955  6114367291       1   2    0    0       1
3  3102330369  3102329297       1   2    0    0       1
4  5203861171  7313916658       1   2    0    0       1